Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ཇི་ལྟར་ཡིད་ལ་བྱེད་པ་བཞིན་དུ་རྨོངས་པ་ཆེན་པོའི་སྒྱུ་མ་སྟོན་པར་བྱེད་དེ། རྒྱལ་པོ་དང་། དམག་སྡེ་ཆེན་པོ་དང་། དྲང་སྲོང་གི་གཟུགས་དང་། གསེར་གྱི་བུམ་པ་ཅན་དང་། མིའི་སེང་གེ་དང་། ཕག་དང་། དགའ་བྱེད་ཀྱི་མཚན་ཉིད་དང་། རོལ་སྙེད་མ་ཕྲོགས་པ་དང་། ཟླ་འོད་མགོ་བོ་ཡོངས་སུ་གཏོང་བ་སྟོན་པར་བྱེད་དོ།
en: He will be able to manifest whatever great illusory appearances come to his mind, such as a great king with a great army or a sage with a golden pitcher, or the appearance of Narasiṃha, Vārāha, Rāma, Lakṣmaṇa, or Sītāharaṇa, or of Candraprabha giving away his own head.

source: །འཇོམས་པ་དང་། གསོད་པ་དང་། སྲོག་འདོར་བ་སྟོན་པར་བྱེད་དོ། །མེ་ཏོག་གི་ཆར་རམ།
en: He can also display striking someone, their death, and their subsequent resurrection.

source: འབྲས་བུའི་ཆར་རམ། རླུང་དང་། སྤྲིན་དང་། སེར་བ་དང་། འབྲུའི་ཆར་སྟོན་པར་བྱེད་དོ།
en: They can display a rain of flowers or fruits, windstorms, clouds, hail, or a rain of edible grains.

source: །རྣམ་པ་སྣ་ཚོགས་པའི་རྣམ་འགྱུར་རྣམས་སྟོན་པར་བྱེད་དེ། གཞལ་མེད་ཁང་ཆེན་པོའི་རྣམ་པ་རྣམས་བསམས་པ་ཙམ་གྱིས་སྟོན་པར་བྱེད་དོ།
en: He will display various apparitions, such as palaces of various types, as soon as he thinks of them.

source: །དགེ་འདུན་གྱི་ནང་དུ་འཇུག་ན། རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་པ་ལ་སོགས་པ་ཡ་མ་ཟུང་གཞལ་དུ་མེད་པ་སྟོན་པར་བྱེད་དོ།
en: He will be able to enter an assembly of monks and display various magical feats, such as conjuring twin palaces. “

source: །བདག་ཉིད་ཀྱི་མགོ་བོ་ལ་བསྐུས་ནས་མགྲིན་པ་ཙམ་གྱིས་དྲི་ཟ།
en: The vidyā holder should use the powder infused with castor oil to anoint his head so that it sprinkles down his neck.

source: ཏིལ་མར་བསྒོས་པའི་ཕྱེ་མས་གཏོར་བར་བྱ་ཞིང་། མིག་སྨན་གྱིས་བྱུག་པར་བྱ། ཕྱེ་མས་ལུས་མཐའ་དག་ལ་བདུག་པར་བྱ་རྐང་པ་ལ་བྱུག་པར་བྱ་སྟེ།
en: He should also anoint his eyes with the eye ointment, fumigate his entire body with the powder, and anoint his feet.

source: དགེ་འདུན་གྱི་ནང་དུ་ཞུགས་ན་ཡང་དག་པར་ཤེས་བཞིན་དང་། ཞི་བ་དང་། དུལ་བ་དང་། ཟུང་ཙམ་དུ་མཐོང་ངོ་།
en: If he then enters an assembly of monks, he will be able to demonstrate knowledge, tranquility, and self-control.

source: །དེ་ནས་ཞུགས་པ་ཙམ་གྱིས་མེའི་ཁམས་སུ་མཐོང་བར་བྱེད་དོ། །སེམས་པར་མཐོང་བར་བྱེད་དོ།
en: As soon as he enters, he will be able to manifest the element of fire or become invisible.

source: །ནམ་མཁའ་ལ་གནས་པར་བྱེད་དོ། །འཆག་པར་བྱེད་དོ། །འདུག་པར་བྱེད་ཅིང་མལ་སྟན་ལ་རྟོག་པར་བྱེད་དོ།
en: He will remain suspended in the air, where he can move about, sit, or lie down.

source: །འོང་བར་བྱེད་ཅིང་འགྲོ་བར་བྱེད་དོ།
en: He will be able to come and go as he pleases.

source: །མེ་ཏོག་འབབ་པར་བྱེད་དོ། །ནམ་མཁའ་ལ་རྔའི་སྒྲ་སྟོན་པར་བྱེད་དོ།
en: He will produce, in the midst of scholars versed in the fourfold knowledge, a rain of flowers or the sound of a drum resounding through space. “

source: །རིག་བྱེད་བཞི་བའི་ནང་དུ་ཤིང་ཨརྐའི་འོ་མས་བསྒོས་ནས་བྱུགས་པ་ཙམ་གྱིས་འཇིག་རྟེན་གསུམ་པའི་གཟུགས་སུ་མཐོང་བར་བྱེད་དོ། །ལྷའི་གར་མཁན་སྣ་ཚོགས་པའི་གཟུགས་སུ་མཐོང་བར་བྱེད་དོ། །ཇི་ལྟ་ཇི་ལྟར་ཡིད་ལ་བྱེད་བཞིན་པའི་བྷཱ་ར་ཏ་དང་། དགའ་བྱེད་རྣམས་མཐོང་བར་བྱེད་དོ།
en: If he smears his body with the preparation blended with the sap of giant milkweed, he will be able to manifest any form found in the three worlds and enact any of the various divine performances from the Mahābhārata or Rāmāyaṇa that he thinks of.

source: །འཁོར་ཆེན་པོའི་དབུས་སུ་རྣམ་པ་སྣ་ཚོགས་པའི་གར་མཁན་རྣམས་སུ་སྟོན་པར་བྱེད་དོ། །རྒྱལ་པོའི་ཕོ་བྲང་དུ་རྒྱལ་པོ་ཆེན་པོ་འཁོར་དང་བཅས་པའི་དབུས་སུ། ལྷའི་གར་མཁན་སྣ་ཚོགས་པ་རྣམས་སུ་མཐོང་བར་བྱེད་དོ།
en: He will be able to magically stage various dramatic performances in the midst of a great crowd.

source: །གླིང་གི་དབང་ཕྱུག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་སྣ་ཚོགས་པ་དང་། མཱན་དྷཱ་ཏ་དང་། ཡིད་ལྡན་དང་། ཤིང་རྟ་བཅུ་པ་དང་། རིན་ཆེན་འོད་དང་། དྲག་པོས་འོད་བྱིན་དང་། མི་བདག་དང་། མངའ་བདག་དང་། ཚོང་བདག་དེད་དཔོན་དང་། ཞི་བ་དང་། མཆེ་བཟང་དང་། སྙིང་རྗེ་ཅན་དང་། པདྨ་དཀར་པོ་ལ་སོགས་པ་རྣམས་དང་ལྷན་ཅིག་པའི་གར་མཁན་རྣམས་སུ་མཐོང་ངོ་།
en: In the midst of a great royal assembly in a royal household, he will conjure various divine performances with a variety of characters such as the wise Māndhātṛ, the wheel-turning monarch of the human race who ruled over the four continents, and Daśaratha, Ratnaprabha, Rudradatta, the caravan leader Nṛpaprabhu, Śivasudaṃṣṭra, Karuṇa­puṇḍarīka, and other great literary characters. “

source: །རིན་པོ་ཆེའི་ཆར་དང་། གོས་ཀྱི་ཆར་དང་། སྤུད་པའི་ཆར་དང་། ལྷབ་ལྷུབ་ཀྱི་ཆར་མཐོང་བར་བྱེད་དོ། །མེ་ཏོག་གི་གཞལ་མེད་ཁང་དང་། འབྲས་བུའི་གཞལ་མེད་ཁང་མཐོང་བར་བྱེད་དོ།
en: He will also produce a rain of jewels and other material things such as ornaments, adornments and jewelry, and he will conjure the Flower Palace, the Fruit Palace, and various other palaces.

source: །གཞལ་མེད་ཁང་ལ་སོགས་པ་རྣམ་པ་སྣ་ཚོགས་པ་མཐོང་པར་བྱེད་དོ། །དེ་ལྟར་ན་མིག་སྨན་དང་ཕྱེ་མ་མཐུ་ཆེན་པོ་བསྐུ་བ་དང་སྦྱོར་བས་གཞལ་མེད་ཁང་དང་། གར་མཁན་དང་། གཞལ་མེད་ཁང་མཐོང་བར་བྱེད་དེ། ཇི་སྲིད་སྒྲ་སྒྲོགས་དང་། འཇིགས་བྱེད་དང་། བུམ་པ་དང་།
en: This ointment and powder thus have great power when applied as an unguent, allowing the vidyā holder to display various palaces, including those described in literature such as the palace of Rāvaṇa, Vibhīṣaṇa, or Kumbha.

source: གཞལ་མེད་ཁང་མཐོང་བ་དང་། ཧ་ནུ་མའི་གཞལ་མེད་ཁང་མཐོང་བར་བྱེད་པ་དང་། གར་མཁན་རྨོངས་པ་ཆེན་པོའི་གཞལ་མེད་ཁང་མཐོང་བར་བྱེད་དོ།
en: He will conjure an illusory display of the palace of Hanumān, and other palaces described in literature.

source: །ཇི་སྲིད་བདུད་འཇོམས་པ་ལ་སོགས་པ་དམག་སྡེ་སྣ་ཚོགས་པའི་མཆོག་གི་གཟུགས་ཀྱི་བར་དུ་མཐོང་བར་བྱེད་དོ། །སྟོབས་དང་། བརྩོན་འགྲུས་ཆེན་པོ་མཐོང་བར་བྱེད་དོ།
en: He will even display the defeat of Māra and other such acts, manifesting the forms of the finest warriors of great valor and strength.

source: །མིག་སྨན་དང་ཕྱེ་མའི་སྦྱོར་བ་གསུམ་གྱི་དངོས་གྲུབ་ནི། བསྐུ་བ་དང་། བཀླགས་པ་དང་། ཡང་དག་པར་སྦྱར་བས་ཚེའི་དངོས་གྲུབ་ཆེན་པོར་འགྱུར་རོ། །སྒྱུ་མའི་རྣམ་འཕྲུལ་སྣ་ཚོགས་པ་འགྲུབ་སྟེ། ཡིད་བཞིན་གྱི་ནོར་བུ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རབ་ཏུ་སྦྱོར་བའི་དངོས་གྲུབ་ཏུ་འགྱུར་རོ།
en: The magical power derived by applying the ointment and powder and then reciting the mantra is threefold: it grants (1) the power of long life, (2) the power to display various illusory spectacles, and (3) the power of the wish-fulfilling jewel.

source: །རབ་ཏུ་སྦྱར་བ་ཙམ་གྱིས་དངོས་གྲུབ་ཆེན་པོ་རྒྱ་ཆེ་བ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མངོན་སུམ་དུ་འགྲུབ་པར་འགྱུར་རོ།
en: Everyone will see that these great magical powers are accomplished as soon as the ointment and the powder are applied. “

source: །སྒྲུབ་པའི་དངོས་གྲུབ་བླ་ན་མེད་པའི་ཆོ་ག་རྨོངས་པ་ཆེན་པོའི་ཆོ་གའོ།། །།
en: This concludes the detailed instructions for the supreme accomplishment of the practice procedure of the great illusion. “

source: དེ་ནས་དཀྱིལ་འཁོར་བཤད་པར་བྱ་སྟེ། དེ་ཁོ་ན་ཉིད་ཀྱི་དངོས་གྲུབ་བླ་ན་མེད་པ་དང་། དོན་ཡོད་ཞགས་པའི་པདྨ་གཙུག་ཏོར་གྱི་དངོས་གྲུབ་དང་། རིག་པ་འཛིན་པ་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་ཀྱི་དེ་ཁོ་ན་ཉིད་བླ་ན་མེད་པའོ།
en: Now I will teach the maṇḍala that brings the supreme accomplishment of truth—the accomplishment of Amoghapāśa-Padmoṣṇīṣa that constitutes the supreme realization of truth for all vidyā holders.

source: །དང་པོར་སྡིག་པ་ཟད་པར་བྱེད་པ་དེ་བཞིན་དུ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་པ། འདོད་པ་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་དང་། དོན་ཡོད་པའི་དངོས་གྲུབ་བླ་ན་མེད་པ་དང་།
en: First, their evil will be exhausted; next, all their obscurations will be dispelled; then, they will win the supreme amogha accomplishment so that all their wishes will be fulfilled.

source: སྔགས་ཀྱི་དངོས་གྲུབ་དང་། མཆོག་གི་དངོས་གྲུབ་དང་། གཟུངས་ཐོབ་པའི་དངོས་གྲུབ་རྣམས་དང་། ས་བཅུ་ལ་རབ་ཏུ་འཇུག་པར་བྱེད་པ་གྲུབ་པ།
en: They will accomplish the mantra, obtain the boons, obtain the dhāraṇī, and attain the tenth bodhisattva level. “

source: སངས་རྒྱས་ཉིད་ཀྱི་སྒྲུབ་ཐབས་དེ་ཁོ་ན་ཉིད་མཐོང་བ་རྨད་དུ་བྱུང་བ། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་ཉེ་བར་འགྲོ་བར་བྱེད་པ། རྡོ་རྗེ་གདན་གྱི་གནས་སུ་ཡང་དག་པར་ལྷག་པར་གནས་པ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱེད་པ། བདུད་འཇོམས་ཤིང་ཚར་གཅོད་པ།
en: Such vidyā holders will attain buddhahood and manifest its true nature in an extraordinary way: they will approach and attain the seat of awakening, sit there on the vajra seat in a state of samādhi, set in motion the wheel of Dharma, disturb and suppress Māra, annihilate all obstacles, and behold the buddha fields as they naturally are.

source: བགེགས་ཐམས་ཅད་ལྷུང་བར་བྱེད་པ། སངས་རྒྱས་ཀྱི་ཞིང་གི་གནས་མཐོང་བར་བྱེད་པ། དེ་ཉིད་ལས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་རློབ་པའི་གནས་དང་མཉམ་པ། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་བའོ།
en: They will become receptacles of all the tathāgatas’ blessings and will bestow the same blessings equally on all beings.

source: །དེ་ནས་པོ་ཊ་ལ་ཀའི་གཞལ་མེད་ཁང་དང་མཉམ་པའི་གནས། དོན་ཡོད་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གནས། སྐད་ཅིག་ལ་མནར་མེད་པའི་གནས་དང་། མཚམས་མེད་པ་ལྔ་རྣམ་པར་སྦྱོང་བར་བྱེད་པ།
en: They will establish themselves in the Potala palace, the abode of Amogha-Avalokiteśvara, and will purify the five acts of immediate retribution that lead to rebirth in the Avīci hell.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་གནས་དང་མཉམ་པ་དང་།
en: They will reach the secret state of all the tathāgatas and become part of the supreme family of all buddhas.

source: དེ་བཞིན་དུ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་མཆོག་བྱང་ཆུབ་སེམས་དཔའི་གཞིའི་གནས་དེ་བཞིན་དུ་རྡོ་རྗེ་སྙིང་པོའི་དགེ་བ་འཕེལ་བ་དེ་གཤེགས་པའི་རིགས་ཀྱི་རིག་སྔགས་ཀྱི་དངོས་གྲུབ་དང་།
en: They will reach the state of bodhisattvas, the auspicious state that arises out of the vajra essence. “

source: དེ་བཞིན་དུ་པདྨའི་རིགས་དང་། དེ་བཞིན་དུ་ནོར་བུའི་རིགས་དང་། དེ་བཞིན་དུ་རྡོ་རྗེའི་རིགས་ཀྱི་དངོས་གྲུབ་དང་། དཀྱིལ་འཁོར་གྱི་གཙོ་བོ་གཅིག་པུར་ཞུགས་པ་དཀྱིལ་འཁོར་གྱི་མཆོག་རི་རབ་ཆེན་པོ་དང་མཉམ་པའི་གནས། དེ་བཞིན་དུ་རྒྱ་མཚོ་ཆེན་པོ་ལྟ་བུ།
en: Such vidyā holders will accomplish the vidyās of the tathāgata, lotus, jewel, and vajra families, but they will enter the supreme maṇḍala—as unshakable as the great Mount Sumeru and as deep as the great ocean—through a single maṇḍala form.

source: ཁྱད་པར་དུ་འཕགས་པའི་གནས་ཐམས་ཅད་དུ་སོན་པ། ཡིད་བཞིན་གྱི་ནོར་བུའི་མཆོག་རབ་ཏུ་སྦྱིན་པ། དཔག་བསམ་ཤིང་དང་མཚུངས་པའི་གནས། ཡིད་ཀྱི་ཤིང་རྟ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ།
en: This place is distinguished among all other places for being like the wish-fulfilling jewel that grants boons, the same as the wish-fulfilling tree that grants all wishes and fulfills all hopes.

source: རེ་བ་ཕུན་སུམ་ཚོགས་པར་བྱེད་པའི་གནས་ཐམས་ཅད་དུ་མཆོག་སྦྱིན་པ་པོ་འདི་ནི་བྱང་ཆུབ་ཀྱི་ས་བོན་གྱི་གནས་ཏེ།
en: It is the place where all boons are obtained and where awakening originates.

source: སེམས་ཅན་ཐམས་ཅད་རྟག་ཏུ་སྒྲོལ་བར་བྱེད་པ།
en: It is the place where all sentient beings are always delivered from saṃsāra.

source: དོན་ཡོད་པའི་གནས་གསང་ཞིང་རྡོ་རྗེ་བྱིན་གྱིས་རློབ་པ་བླ་ན་མེད་པའོ། །བསོད་ནམས་ཐམས་ཅད་འགུགས་པར་བྱེད་པའི་གནས། དགེ་བའི་རྩ་བ་ཐམས་ཅད་རྣམ་པར་འཕེལ་བར་བྱེད་པ།
en: It is the secret amogha place where the vajra blessing is conferred, a place that attracts all merit and causes the roots of virtue to grow.

source: འདི་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་གནས།
en: This place is a heap of merit. “

source: ཆོས་ཀྱི་མཛོད་དང་རྟག་ཏུ་མཉམ་པ། སངས་རྒྱས་ཀྱི་མཛོད།
en: This place is a perpetual treasure trove of the Dharma and a treasure trove of the Buddha.

source: མཛོད་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་མཛོད་ལ་མཁས་པ་རྟག་ཏུ་པདྨའི་མཛོད།
en: It is a great treasury, a perpetual lotus treasury, a treasure trove of Avalokiteśvara’s skill.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཛོད། རྡོ་རྗེའི་མཛོད། དེ་བཞིན་དུ་ནོར་བུ་ཆེན་པོ་ཉིད་ཀྱི་མཛོད།
en: It is the treasure trove of all the tathāgatas, a diamond treasury, and a great jewel.

source: རྒྱ་མཚོ་ཆེན་པོ་ལྟར་ཟབ་པ། མི་གཡོ་བ། མི་འགུལ་བ། ཟིལ་གྱིས་མི་ནོན་པའོ། །བདུད་དང་། ལོག་པར་འདྲེན་པ།
en: It is as deep as the great ocean, immovable and unshakable.

source: བགེགས་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། སྲིན་པོ་ཐམས་ཅད་ཀྱིས་སྡང་བའི་སེམས་ཀྱིས་འཇུག་པར་མི་ནུས་སོ།
en: It cannot be assailed by any evil-minded māras, vināyakas, vighnas, yakṣas, rākṣasas, or bhūtas.

source: །དེ་ལ་མི་གཡོ་བའི་གནས་རྙེད་དཀའ་ཞིང་བླ་ན་མེད་པའོ།
en: Once there, it is not possible to turn back. This supreme, unshakable place is difficult to reach. “

source: །དཀྱིལ་འཁོར་གྲུ་བཞི་པར་བྱ་སྟེ། བ་བྱུང་དང་ཡང་དག་པར་ལྡན་པ། ཁྲུ་སུམ་ཅུ་རྩ་གཉིས་པ་བྱའོ། །ཡང་ན་ཁྲུ་བརྒྱད་པར་བྱ་སྟེ།
en: Using cow dung, the vidyā holder should build a four-cornered maṇḍala that is either thirty-two cubits or eight cubits across, with an elevation of one cubit and a half.

source: དེ་ཕྱེད་དང་གཉིས་ཀྱི་ཁྲུའི་ཚད་ཀྱི་ཐིག་སྐུད་ཀྱིས་ཚད་རྣམ་པར་ཕྱེ་སྟེ་གདབ་པར་བྱའོ།
en: The measurements should be done with a measuring thread.

source: །གྲྭ་བཞི་མཉམ་པར་ཕྱེ་བ། ལོགས་བཞི་ལེགས་པར་རྣམ་པར་ཕྱེ་བ།
en: The maṇḍala should be square in shape, carefully delimited, and symmetrical.

source: ཤིན་ཏུ་འཇམ་པ། ཤིན་ཏུ་ལེགས་པར་བཅགས་པ། བསྙེན་ལ་འཇམ་ཤིང་བརྒྱན་པ།
en: Its surface should be wiped clean and be smooth, soft, and well adorned.

source: ས་གཞི་བཻ་ཌཱུརྱའི་ཁ་དོག་ལ་དཀྱིལ་འཁོར་མཛེས་པ་ཐིག་གིས་ཆར་རྣམ་པ་དབྱེ་བར་བྱ་སྟེ།
en: The surface of the maṇḍala, which is of a beautiful beryl-color, should be divided into sections using the measuring thread.

source: སྒོ་བཞི་རྣམ་པར་ཕྱེ་བ། སྐུད་པ་ལ་ཚོན་སྣ་ལྔ་བྱིན་ཏེ།
en: The vidyā holder should mark out the four doors and demarcate the inner sections of the maṇḍala by applying the five colors.

source: དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོར་གྲུ་བཞི་པར་རྣམ་པར་དབྱེའོ། །ཁྲུ་གཉིས་ཀྱི་ཚད་ཀྱིས་རེ་ཁཱ་ལྔ་རྣམ་པར་དབྱེའོ། །དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོར་པདྨ་འདབ་མ་སུམ་ཅུ་རྩ་གཉིས་པ་ཀུན་ནས་རྒྱས་པ་བྲི་བར་བྱ་སྟེ།
en: Stretching the thread, he should demarcate the four corner-sections with a fivefold line, so that each one is two cubits in size. “

source: དབུས་ཀྱི་པདྨའི་གེ་སར་ལ། དོན་ཡོད་པ་པདྨའི་གཙུག་ཏོར་བྱ་སྟེ། པདྨ་ཕྱེད་ཁ་བྱེ་པའི་པདྨའི་འདབ་མའི་སྟེང་དུ། པདྨ་ལ་ཞལ་གསུམ་པར་བྲི་བར་བྱ་སྟེ། བདེ་བའི་གཟུགས་དང་མཚན་གྱིས་བརྒྱན་པ།
en: In the center of the maṇḍala he should draw an open lotus with thirty-two petals, at the center of which, sitting above the lotus petals on the anthers of a half-open lotus, he should draw Amogha­padmoṣṇīṣa with three faces, a happy countenance, and the marks of perfection.

source: གཙུག་ཏོར་གྱི་རྣམ་པ་འབར་བའི་སྙིང་པོ་ལ་ཁོར་ཡུག་ཏུ་ཡོངས་སུ་བསྐོར་བ་བྲིའོ།
en: The image of an uṣṇīṣa suffused with light should be drawn in a circle surrounding him.

source: །གཞོགས་གཡས་སུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་རལ་པའི་ཅོད་པན་གྱིས་བརྒྱན་པ་དབུལ་འོད་དཔག་མེད་འབར་བའི་སྙིང་པོའི་ལུས་ཅན་ནོ།
en: To Amogha­padmoṣṇīṣa’s right he should draw the form of Noble Avalokiteśvara with his hair in a topknot adorned with a diadem. Above his head is Amitābha, his body filled with light.

source: །གཞོགས་གཡོན་དུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་རལ་པ་དང་རྒྱན་བཅིངས་པ།
en: To Amogha­padmoṣṇīṣa’s left he should draw the form of Noble Avalokiteśvara with his hair in a topknot and his body filled with light.

source: འབར་བའི་སྙིང་པོའི་ལུས་དང་དབུ་ལ་པདྨ་གཙུག་ཏོར་གྱི་ཁོར་ཡུག་ཏུ་འོད་ཟེར་སྣ་ཚོགས་འབར་བའོ།
en: On top of his head is a lotus uṣṇīṣa radiating multicolored light. “

source: །ཕྱི་རོལ་དུ་ཙམ་པ་ཀ་དང་། བཱརྵི་ཀ་དང་། ཨུཏྤལ་སྔོན་པོའི་མེ་ཏོག་གི་ཕྲེང་བ་བཅིང་བར་བྱའོ།
en: The vidyā holder should place garlands of champak flowers and white and blue lotuses outside the maṇḍala.

source: །དེ་ནས་དཀྱིལ་འཁོར་གྱི་སྙིང་པོའི་གྲྭ་བཞིའི་གནས་རྣམས་སུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བྲི་བར་བྱ་སྟེ། གོ་ཆ་དང་ཡ་ལད་བགོས་པ་དྲག་པོའི་གཟུགས་ཅན་འཇིགས་པར་བྱེད་པ་འབར་བའི་ཕྲེང་བའི་སྙིང་པོའི་ལུས་སོ། །དཀྱིལ་འཁོར་གྱི་རེ་ཁཱ་སྔོན་མ་ལ།
en: Inside the maṇḍala, in the four corners, he should draw the Four Great Kings wearing coats of mail, looking fierce and inspiring dread, and with bodies surrounded by halos of light.

source: རྡོ་རྗེ་དང་མདུང་རྩེ་གསུམ་པའི་རེ་ཁཱ་འབར་བ་དང་བཅས་པ་བྲི་བར་བྱའོ།
en: Surrounding the maṇḍala he should draw an inner line of vajras and tridents that blaze with light.

source: །རེ་ཁཱ་རིམ་པར་ཕྱེ་བ་གཉིས་པ་ལ་མེ་ཏོག་གི་རེ་ཁཱ་བྲི་བར་བྱའོ། །གསུམ་པ་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་སྐུད་པ་རེ་ཁཱ་བྲི་བར་བྱའོ། །རེ་ཁཱ་བཞི་པ་ལ་ལག་པའི་ཕྱག་རྒྱ་མཚོན་ཆ་སྣ་ཚོགས་པ་འཛིན་པ་བྲི་བར་བྱའོ། །རེ་ཁཱ་ལྔ་པ་ལ་ཁ་ཁྱེར་གྱི་རྣམ་པ་བྲི་བར་བྱ་སྟེ།
en: A second line, outside of that, should consist of a corona of flowers; then there should be a large string of jewels as the third, a circle of hands holding various implements as the fourth, and a fifth circle composed of a surrounding pavilion.

source: ཚོན་སྣ་ཚོགས་པས་རྣམ་པར་ཕྱེ་བ་རྣམ་པར་བཀྲ་བའོ། །དཀྱིལ་འཁོར་གྱི་ཕྱིའི་ཁོར་ཡུག་ཏུ་མཚན་མའི་ཕྱག་རྒྱ་མཚོན་ཆ་སྣ་ཚོགས་པ་རྣམས་བྲི་བར་བྱའོ།
en: Different parts of the maṇḍala should have their own distinguishing colors, and the exterior of the maṇḍala should be surrounded with various signs, emblems, and implements. “

source: །དཀྱིལ་འཁོར་གྱི་སྒོ་བཞི་རྣམས་སུ་གནོད་སྦྱིན་ཆེན་པོ་བཞི་བྱ་སྟེ།
en: Within the four doors the vidyā holder should draw the four great yakṣas—wild, laughing loudly, and grimacing with protruding fangs.

source: དྲག་པོ་དྲག་ཏུ་རྒོད་པའི་གཟུགས་ཅན་མཆེ་བ་གཙིགས་པ་བཞིན་རྣམ་པར་འགྱུར་བ་བུམ་པ་གང་བ་ཐོགས་པ།
en: They each hold a full jar, their hair streams upward, and they are each adorned with every ornament and wearing diadems atop their heads.

source: སྐྲ་བརྫེས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་ཐོད་པའི་ཅོད་པན་ཅན་འབར་བའི་སྙིང་པོའི་ལུས་ཅན་རི་བོའི་གདན་ལ་གནས་པར་བྱའོ།
en: They should be drawn sitting on mountains, their bodies surrounded with a halo of light.

source: །དཀྱིལ་འཁོར་གྱི་རེ་ཁཱའི་ཕྱི་རོལ་དུ་ཕྲེང་གསུམ་འགྱུར་དུ་བྲི་བར་བྱའོ། །པདྨ་དང་། ཨུཏྤལ་སྔོན་པོ་དང་། ཙམ་པ་ཀ་དང་། སྣ་མའི་མེ་ཏོག་དང་།
en: Beyond the outer rim of the maṇḍala, the vidyā holder should draw three separate lines of pink lotuses, blue lotuses, champak flowers, sumanas jasmine, vārṣika jasmine, and adhimuktaka jasmine.

source: བཱརྵི་ཀ་དང་། ཨ་དྷི་མུཀྟ་ཀ་རྣམས་རྣམ་པར་དབྱེ་བར་བྱའོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་དཀྱིལ་འཁོར་ལེགས་པར་བྲི་བར་བྱས་ནས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། ཤིན་ཏུ་མཁས་པ་དཀྱིལ་འཁོར་གྱི་ཁོར་ཡུག་ཏུ་རྒྱན་དང་། རྟ་བབས་བཞིས་མཛེས་པར་བྱས་པ།
en: Having skillfully painted and demarcated the parts of the maṇḍala, the vidyā holder should adorn each of the maṇḍala’s four sides with gateways decorated with arrows and banners in various bright colors.

source: ཁོར་ཡུག་ཏུ་མདའ་དང་། ཚོན་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བཀྲ་བའི་བ་དན་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: He should further surround the maṇḍala with parasols, flags, banners, canopies, and streamers. “

source: བ་དན་དང་། བླ་རེ་དང་། དར་དཔྱངས་དང་། ཁོར་ཡུག་ཏུ་བུམ་པ་གང་བ་བཅུ་དྲུག་དང་། གཏོར་མའི་བུམ་པ་བཅུ་དྲུག་དང་།
en: He should arrange sixteen full jars around the maṇḍala, as well as another sixteen jars with bali articles.

source: དེ་བཞིན་དུ་བདུག་པའི་སྣོད་བཅུ་དྲུག་དང་། གཞོང་པ་བཅུ་དྲུག་ཏུ་རབ་ཏུ་བརྗོད་དོ། །ཁམ་པོར་བཅུ་དྲུག་ཏུ་བཤད་པ་དང་།
en: He should add the prescribed sixteen incense holders with lit incense, as well as earthenware bowls, which, according to tradition, should likewise number sixteen.

source: དྲི་སྣ་ཚོགས་པའི་སྣོད་དང་། ལྷུང་བཟེད་བཅུ་དྲུག་ཉིད་དང་། མཆོད་ཡོན་གྱི་སྣོད་བཅུ་དྲུག་དང་།
en: He should add sixteen bowls with various perfumes and sixteen bowls with an argha offering.

source: དངུལ་གྱི་སྣོད་བཞི་དང་། དྲིའི་ཕྱེ་མ་རྣམས་བཞག་ཅིང་གཏོར་མའི་བུམ་པ་བཅུ་དྲུག་བཞག་ནས་པོག་ཕོར་བཞིའི་ནང་དུ་ཙནྡན་དང་། ཨ་ག་རུ་དང་དུ་རུ་སྐ་དང་པོག་དང་། གུ་གུལ་གྱི་བདུག་པ་སྲེག་ཅིང་དེ་བཞིན་དུ་སྤྲྀ་ཀ་དང་། སྲ་རྩི་པོག་དང་།
en: In addition, he should arrange four silver bowls with fragrant powders, sixteen earthenware pots with bali articles, and four incense holders in which he should burn incense of sandalwood, agarwood, olibanum, frankincense, bdellium, fenugreek, the resin of the sal tree, saffron, musk, myrrh, and camphor, all combined in the right proportion.

source: གུར་གུམ་དང་། གླ་རྩི་དང་། བོ་ལ་དང་། ག་པུར་ཙམ་དང་ཡང་དག་པར་ལྡན་པའོ། །དཀྱིལ་འཁོར་གྱི་ལྷ་ཐམས་ཅད་ཀྱི་བྱུག་པ་འདི་ཉེ་བར་གཞག་པར་བྱའོ།
en: Before each maṇḍala deity he should place unguents made of the same ingredients combined with fragrant powders that contain sandalwood and saffron.

source: །ཙནྡན་དང་། གུར་གུམ་དང་། དེ་བཞིན་དུ་ཛཻ་གྷ་དང་། བལླི་ཀའི་ཕྱེ་མ་རྣམས་ཐམས་ཅད་ཡང་དག་པར་སྦྱར་བ་འདིས་ཕྱེ་མར་སྦྱར་བས་བསྒོས་པའོ།
en: Everything should contain an admixture of jaigha and vallika powders.

source: །མེ་ཏོག་སྣ་ཚོགས་གཅལ་དུ་བཀྲམ་ཞིང་ཇི་ལྟར་འདོད་པ། ཇི་ལྟར་སྟོང་པ་དང་། ཇི་ལྟར་ཐོབ་པའི་མེ་ཏོག་མཛེས་པ་མངོན་པར་གཏོར་བར་བྱའོ།
en: He should strew the maṇḍala with various flowers of his choosing, whatever may be available in the season. “

source: །དཀྱིལ་འཁོར་གྱི་ཁོར་ཡུག་ཏུ་དྲིའི་ཆུས་གང་བའི་བུམ་པ་མ་རེག་པ་དང་གསེར་དང་། དངུལ་ལས་བྱུང་བའི་སྣོད་གསར་པ་ཉིད་དང་། ཟངས་དང་ས་ལས་བྱུང་བའི་མཆོག་དང་། དྲི་སྣ་ཚོགས་སྦྱར་བས་དགང་བར་བྱའོ། །བུམ་པ་དང་བཀྲ་ཤིས་བཅིང་བར་བྱ་ཞིང་པི་ཝང་དང་།
en: He should then fill a pitcher with scented water without touching it, and he should fill new bowls made of gold, silver, copper, and clay with an assortment of fragrances.

source: གོས་བཟང་པོ་དང་། རྒྱན་དང་། ལྷབ་ལྷུབ་རྣམས་ཀྱིས་བརྒྱན་པར་བྱའོ། །རིང་བསྲེལ་པདྨའི་སྟེང་དུ་བཞག་ནས་བུམ་པ་དང་། གཙུག་ཏོར་གྱི་མཚན་ཉིད་དང་།
en: He should tie fine pieces of silk around the neck of the auspicious pitcher, adorn it with ornaments and adornments, and place it above a lotus relic.

source: སྣ་མའི་མེ་ཏོག་དང་། གདུ་བུ་བྱས་ནས་གཞག་པར་བྱའོ། །དབུས་ཀྱི་སྙིང་པོའི་དཀྱིལ་འཁོར་དུ་སྙིང་པོ་དང་། ཉེ་བའི་སྙིང་པོ་ཉིད་ཀྱི་གསང་སྔགས་སྟོང་ཕྲག་བརྒྱད་བཟླས་སོ།
en: He should make a wreath from jasmine flowers that symbolizes the uṣṇīṣa and place it inside the maṇḍala, incanting it one thousand and eight times with the heart mantra and the auxiliary heart mantra.

source: །དེ་ནས་གཏོར་མའི་ལས་ལ་མཉམ་པར་བཞག་ནས་སྣ་ཚོགས་པའི་གཟུགས་རྣམ་པ་སྣ་ཚོགས་དང་།
en: He should put together an assortment of articles for the bali offering that consist of the ‘white’ foods of different flavors.

source: དཀར་པོ་དང་། དེ་བཞིན་དུ་སྣ་ཚོགས་པའི་གཟུགས་ཉིད་དང་སྣ་ཚོགས་པའི་རོ་གཞག་པར་བྱའོ། །རྣམ་པ་སྣ་ཚོགས་སུ་ཕྱེ་བའི་སྣ་ཚོགས་པའི་གཟུགས་དང་། སྣ་ཚོགས་པའི་ཁ་དོག་དང་རོ་ཉིད་དང་སྣ་ཚོགས་པའི་ཡུལ་དུ་རྒྱུ་བ་སྟེ། འདི་ནི་གཏོར་མར་བརྗོད་དེ།
en: The dishes should be prepared according to a variety of recipes and be of various types, forms, colors, and tastes that represent diverse regional cuisines.

source: འབྱོར་བའི་གཏོར་མར་བཤད་དོ།
en: The instructions for the bali offering presented here conform to tradition. “

source: །དཀྱིལ་འཁོར་གྱི་ཁོར་ཡུག་ཏུ་རྒྱན་གདགས་ཏེ་སྣ་ཚོགས་པའི་འབྲས་བུ་རྒྱ་ཆེན་པོ་དང་། སྣ་ཚོགས་པའི་ལོ་མ་སྔོན་པོའི་ཕྲེང་བ་དང་།
en: The learned vidyā holder should adorn the maṇḍala by skillfully arranging various fruits, green branches, and garlands around it.

source: མར་མེའི་ཕྲེང་བ་བརྒྱ་རྩ་བརྒྱད་དང་། ཇི་ལྟར་རྙེད་པའི་མར་དང་ཏིལ་མར་གྱིས་ཀུན་ནས་བཀང་བ་བརྒྱ་རྩ་བརྒྱད་དོ།
en: He should surround the maṇḍala with a row of one hundred and eight lamps, each filled with ghee and oil.

source: །བདག་དངོས་གྲུབ་འདོད་པ་རྣམས་ཕྱེ་དང་།
en: As has been taught, the vidyā holder will realize all his wishes and attain complete success.

source: ལ་ཕུག་དང་། དཀར་དང་། ལ་དུ་དང་། སྲན་མ་མུད་གའི་ལ་དུ་དང་།
en: To the vināyakas he should offer a bali consisting of barley groats, radishes, the ‘white’ foods, laduka sweets, candies, and fruits.

source: འབྲས་བུ་རྣམས་དེ་བཞིན་དུ་ལོག་འདྲེན་ལ་གཏོར་མར་བྱིན་པས་ལས་ཐམས་ཅད་བདེ་བླག་ཏུ་འགྲུབ་བོ།
en: This will ensure swift success in all his activities. “

source: །ཕྱེའི་ཟན་དང་། ཞོའི་ཉིང་ཁུ་དང་། ལོ་མ་སྔོན་པོ་ཉིད་གནོད་སྦྱིན་དང་། སྲིན་པོ་ཀུན་ནས་ཕྱོགས་བཞིར་གནས་པ་རྣམས་ལ་གཏོར་མར་སྦྱིན་པར་བྱའོ།
en: He should then place cooked barley, curds, and green branches in the maṇḍala and offer it as bali to the yakṣas and rākṣasas who inhabit the four quarters.

source: །ཞོའི་ཟན་དང་འོ་མ་ཡང་སྟེ། འདི་ནི་འབྱུང་པོའི་གཏོར་མར་བཤད་དོ། །ལོ་མའི་གོང་བུ་དང་།
en: A bali regarded as suitable for bhūtas, on the other hand, consists of curds and porridge of rice and milk.

source: ཕྱེ་དང་། འབྲས་ཐུག་པོ་ཆེའི་ཟན་དང་། དེ་བཞིན་དུ་འཁུར་བ་ཟླུམ་པོ་སྟེ། འདི་ནི་ཕྱོགས་བཞིར་ཡི་དགས་དང་ཤ་ཟ་རྣམས་ལ་གཏོར་མར་སྦྱིན་པར་བྱའོ། །འབྲས་ཐུག་པོ་ཆེ་དང་།
en: Balls of picchala and śākha, a porridge of barley and rice, and maṇḍalikā are offered as bali to the pretas and piśācas in the four directions.

source: འོ་མའི་ཟན་ནི་ཟླ་བ་དང་། ཉི་མའི་ཚོགས་ཀྱིས་ལྷན་ཅིག་པའི་ལྷ་དང་རྒྱུ་སྐར་རྣམས་ཀྱི་གཏོར་མར་བྱའོ།
en: Porridge of rice and milk is offered as bali to the celestial nakṣatras, Candra, Sūrya, and the gaṇas.

source: །རྟག་ཏུ་ཙནྡན་གྱི་ཆུ་དང་། དེ་བཞིན་དུ་མེ་ཏོག་དང་འོ་མའི་ཟན་ནི་མཚན་མོའི་ལྷ་ལ་གཏོར་མར་སྦྱིན་པར་བྱ་སྟེ་ལས་ཀྱི་དངོས་གྲུབ་བླ་ན་མེད་པའོ།
en: A bali offered to the deities of the night consists of sandalwood water, and it always includes flowers and milk porridge. This ensures the success of the rite. “
